app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", ":)"], ["commenter", "cla"], ["created_at", Mon, 28 Apr 2014 08:48:32 UTC +00:00], ["post_id", 1], ["updated_at", Mon, 28 Apr 2014 08:48:32 UTC +00:00]]
---
	def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)