app/controllers/posts_controller.rb

  def create
   @post = Post.new(post_params)

   if @post.save
---
INSERT INTO "posts" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", ""], ["created_at", Fri, 25 Apr 2014 07:37:53 UTC +00:00], ["updated_at", Fri, 25 Apr 2014 07:37:53 UTC +00:00]]

def sweet
    @post = Post.find_by(id: params[:id])

    if @post
      @post.sweet = @post.sweet.to_i + 1
      if @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "20"]]
UPDATE "posts" SET "sweet" = ?, "updated_at" = ? WHERE "posts"."id" = 20  [["sweet", 1], ["updated_at", Wed, 30 Apr 2014 02:25:23 UTC +00:00]]

def sour
    @post = Post.find_by(id: params[:id])

    if @post
      @post.sour = @post.sour.to_i + 1
      if @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 20 LIMIT 1
UPDATE "posts" SET "sour" = ?, "updated_at" = ? WHERE "posts"."id" = 20  [["sour", 1], ["updated_at", Wed, 30 Apr 2014 02:41:39 UTC +00:00]]