app/controllers/registers_controller.rb

INSERT INTO "registers" ("created_at", "password", "password_confirmation", "updated_at", "username") VALUES (?, ?, ?, ?, ?)
---
  def create
	  @register = Register.new(register_params)


	 if @register.save

SELECT "registers".* FROM "registers" WHERE "registers"."id" = ? LIMIT 1  [["id", "1"]]
---
def show
  @register = Register.find(params[:id])