app/controllers/session_controller.rb

  def create
  	sweeter = Sweeter.find_by_username(params[:username])
---
SELECT "sweeters".* FROM "sweeters" WHERE "sweeters"."username" = 'clarissa' LIMIT 1