app/controllers/sweeters_controller.rb

  def index
    @sweeters = Sweeter.all
---
SELECT "sweeters".* FROM "sweeters"

  def create
    @sweeter = Sweeter.new(sweeter_params)

    respond_to do |format|
      if @sweeter.save
---
INSERT INTO "sweeters" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)

    def set_sweeter
      @sweeter = Sweeter.find(params[:id])
---
SELECT "sweeters".* FROM "sweeters" WHERE "sweeters"."id" = ? LIMIT 1  [["id", "1"]]