app/controllers/swits_controller.rb

  def create
	 @swit = Swit.new(swit_params)

	 if @swit.save
---
INSERT INTO "swits" ("created_at", "password", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Fri, 25 Apr 2014 06:10:47 UTC +00:00], ["password", "1234"], ["updated_at", Fri, 25 Apr 2014 06:10:47 UTC +00:00], ["username", "clarissaestremos"]]

def show
  @swit = Swit.find(params[:id])
---
SELECT "swits".* FROM "swits" WHERE "swits"."id" = ? LIMIT 1  [["id", "1"]]

def index
  @swits = Swit.all
---
SELECT "swits".* FROM "swits"